In [28]:
def descending(val = 111111):
    if val > 0:
        val = str(val)
    new_val = [n for n in val]
    new_val.sort(reverse=True)
    print(''.join(new_val))
# preferable to pass a default value in case nothing is passed in

In [29]:
descending(1984)

9841

In [30]:
descending(94385398)

99885433

In [27]:
descending()

111111

In [45]:
import pandas as pd
import numpy as np
import datetime

file_to_load = 'JEOPARDY_CSV.csv'

jeopardy_df = pd.read_csv(file_to_load)
jeopardy_df.head()

,Show Number,Air Date,Round,Category,Value,Question,Answer
0,4680,12/31/2004,Jeopardy!,HISTORY,$200,"For the last 8 years of his life, Galileo was ...",Copernicus
1,4680,12/31/2004,Jeopardy!,ESPN's TOP 10 ALL-TIME ATHLETES,$200,No. 2: 1912 Olympian; football star at Carlisl...,Jim Thorpe
2,4680,12/31/2004,Jeopardy!,EVERYBODY TALKS ABOUT IT...,$200,The city of Yuma in this state has a record av...,Arizona
3,4680,12/31/2004,Jeopardy!,THE COMPANY LINE,$200,"In 1963, live on ""The Art Linkletter Show"", th...",McDonald's
4,4680,12/31/2004,Jeopardy!,EPITAPHS & TRIBUTES,$200,"Signer of the Dec. of Indep., framer of the Co...",John Adams

In [17]:
jeopardy_df.describe()

         Show Number
count  216930.000000
mean     4264.238519
std      1386.296335
min         1.000000
25%      3349.000000
50%      4490.000000
75%      5393.000000
max      6300.000000

#### There are 216930 rows and each row represents a Jeopardy question and answer from a particular show.

In [18]:
# number of rows in dataframe. A row represents a jeopardy question from a particular show.
jeopardy_df['Show Number'].count()

216930

In [70]:
# how many shows were there

unique_shows= jeopardy_df['Show Number'].value_counts()
unique_shows

2941    62
5332    62
5169    61
3890    61
5937    61
        ..
3656    30
2757    30
6300    30
3022    16
1178    12
Name: Show Number, Length: 3640, dtype: int64

In [48]:
jeopardy_df.columns= jeopardy_df.columns.str.rstrip()
jeopardy_df.columns= jeopardy_df.columns.str.lstrip()

In [49]:
jeopardy_df.columns

Index(['Show Number', 'Air Date', 'Round', 'Category', 'Value', 'Question',
       'Answer'],
      dtype='object')

In [50]:
jeopardy_df['Air Date'].head()

0    12/31/2004
1    12/31/2004
2    12/31/2004
3    12/31/2004
4    12/31/2004
Name: Air Date, dtype: object

In [79]:
jeopardy_df['year'] = pd.DatetimeIndex(jeopardy_df['Air Date']).year
jeopardy_df.head()
jeopardy_df.tail()

,Show Number,Air Date,Round,Category,Value,Question,Answer,year
216925,4999,5/11/2006,Double Jeopardy!,RIDDLE ME THIS,"$2,000",This Puccini opera turns on the solution to 3 ...,Turandot,2006
216926,4999,5/11/2006,Double Jeopardy!,"""T"" BIRDS","$2,000",In North America this term is properly applied...,a titmouse,2006
216927,4999,5/11/2006,Double Jeopardy!,AUTHORS IN THEIR YOUTH,"$2,000","In Penny Lane, where this ""Hellraiser"" grew up...",Clive Barker,2006
216928,4999,5/11/2006,Double Jeopardy!,QUOTATIONS,"$2,000","From Ft. Sill, Okla. he made the plea, Arizona...",Geronimo,2006
216929,4999,5/11/2006,Final Jeopardy!,HISTORIC NAMES,None,A silent movie title includes the last name of...,Grigori Alexandrovich Potemkin,2006

### Unique shows in each year

In [86]:
unique_shows_year = pd.Series(jeopardy_df.groupby('year')['Show Number'].nunique())
print(unique_shows_year)

year
1984     23
1985     16
1986     25
1987     22
1988     22
1989     36
1990     73
1991     24
1992     32
1993     35
1994     19
1995     19
1996     83
1997    221
1998    223
1999    229
2000    225
2001    203
2002    114
2003    158
2004    220
2005    225
2006    230
2007    231
2008    232
2009    226
2010    231
2011    224
2012     19
Name: Show Number, dtype: int64